<template>
  <div id="app">
    <PieChart class="pie" :data="rawData" />
  </div>
</template>

<script>
import PieChart from "./components/PieChart.vue";

export default {
  components: {
    PieChart,
  },
  data: () => ({
    rawData: [
      {
        Male: {
          "18-24": 433,
          "25-34": 1367,
          "35-44": 2974,
          "45-54": 2650,
          "55-64": 1491,
          "65+": 1086,
        },
        Female: {
          "18-24": 597,
          "25-34": 1482,
          "35-44": 1957,
          "45-54": 2653,
          "55-64": 1719,
          "65+": 1601,
        },
      },
      {
        Male: {
          "18-24": 2930,
          "25-34": 12939,
          "35-44": 23299,
          "45-54": 2323,
          "55-64": 12389,
          "65+": 945,
        },
        Female: {
          "18-24": 2930,
          "25-34": 69990,
          "35-44": 49000,
          "45-54": 40030,
          "55-64": 30030,
          "65+": 1304,
        },
      },
    ],
  }),
};
</script>

<style scoped>
.pie .piechart .male:hover + .bar {
  display: block;
}
.bar {
  display: none;
}
</style>



// 1. 製作一套圓餅圖，顯示總人數與男女比例 
// 2. 滑鼠移入時，跳出浮動視窗，顯示各性別人數與年齡分佈長條圖 
// 3. 年齡分佈長條圖之顏色深淺與各年齡所佔比例成正比 
// 4. 切換 dataset 時，圓餅圖動態調整比例與總人數 
// 評比標準 
// 1. 需求完成度 
// 2. 操作與顯示流暢度 
// 3. 跨瀏覽器相容性(Chrome、Safari、Firefox、MS Edge) 
// 4. 程式碼架構可讀性與延展性 
// 5. 介面美觀度 
// 備註 
// 1. 不限制編寫語言，React 與 Vue 皆可接受 
// 2. 不限制使用 html tag，canvas、svg ，甚至使用 div 皆可接受，只要能完成需求，操作流暢，程式碼容易維護皆可 
//3. 作業繳交方式：將程式碼打包回傳或放在 github 上皆可，但必須要有管道可以看到完整程式碼，並在各瀏覽器上可以順利操作